#pragma once

#include <string>

class Action {
    QSPString *Image; // первый аргумент, строка, при добавлении акшена
    QSPString *Desc; //нулевой аргумента, строка, при добавлении акшена
    QSPString *OnPressLines; //третий-четвертый-пятый аргументы добавления акшена. из третьего(строка) вырезается кусок номарами с четвертого по пятый.
    int OnPressLinesCount; //по процедуре добавления, понятно, что это длина строки OnPressLines, и потому не вижу необходимости хранить в памяти, но! возможно это будет ускорять выполнение.
    int Location;
    int ActIndex;
    //TODO: вообще, помоему, это нафиг лишнее всё, тут должен быть тупо массив строк:
    // нулевой элемент - дескрипшен
    // первый - имедж
    // прочие - аргументы.
    // количество аргументов хранить можно, но.. надо ли?
    // локейшен - пока смысль не ясен.
    // акт индекс - тоже пока не ясна сцуть.
public:
    Action() {};
    Action(QSPString Des, QSPString Img, QSPString code) {};
    ~Action() {};
    QSPString GetDesc() { return *Desc; };
    void Execute(int ind);
};
