#include "qsp_game.h"

void qsp_game::ClearIncludes(bool isFirst)
{
    int i, count;
    if (!isFirst)
    {//TODO: первое - уходим от массива фиксированной длины. и потому размер массива нам хратить без надобности, ибо у вестора есть сайз.
        //TODO: второе. вектор стрингов надо таки определить отдельным классом, коему вписать метод очистки.
        CurIncFiles.ClearStrings();
        if (CurIncLocsCount)
        {
            count = qspLocsCount - qspCurIncLocsCount; //локс-каунт - объ€влено в хедере локаций, нативном.
            //вот тут нихера не пон€л. у локаций есть счотчик. у гейма есть счотчик.
            //убив сведени€ о файлах, гуртом, смотрим, и если видим что локаций в гейме есть, то!
            //по разнице между счетчиком локаций в гейме и в фасаде локаций создаем мир.... ну как-то дико.
            qspCreateWorld(count, count);
            //а потом оные локации готовим.
            qspPrepareLocs();
            //и в итоге принудительно пишем что ноль файлов, ноль локаций.
        }
    }
    CurIncLocsCount = 0;
}
